abstract class BagTitile {
  static const title1 = 'Icy cream',
      title2 = 'Morronito',
      title3 = 'Furry',
      title4 = 'Wild Rose',
      title5 = 'Valencia',
      title6 = 'Serpiente',
      title7 = 'Conejito negro',
      title8 = 'Navy';
}

abstract class BagDescription {
  static const descript1 =
          'Хотите быть стильной и модной этим летом? Мягкая, яркая , цветная, вместительная сумочка в цвете фуксия вам в этом поможет. Летняя прямоугольная, квадратная мини сумка-багет станет вашим незаменимым спутником в любой ситуации. Она средняя по размеру, подойдет как для повседневной носки, также как офисная или вечерняя. Легко вмещает в себя телефон, планшет, документы, косметику и другие принадлежности.',
      descript2 =
          'Встречайте нашу новую женскую сумку-шоппер на молнии, которая станет вашим незаменимым компаньоном в повседневной жизни! Эта стильная женская сумка шоппер сочетает в себе элегантность и практичность - идеальный выбор для всех активных и модных дам, девушек и школьниц. Изготовленная из высококачественной, непромокаемой и прочной искусственной кожи, она обеспечит вам долгий срок службы и сохранит свой первоначальный современный вид.',
      descript3 =
          'Женская кросс-боди сумка через плечо коричневого цвета с широким ремнем и регулировкой. У сумочки декоративная цепочка из металла с переплетом эко кожи. Золотистый поворотный замочек. Основное отделение закрывается на молнии, имеется внутреннее на замочке-молнии для хранения карт и чего то более драгоценного. Маленькая летняя сумка красивый аксессуар как для девушки, женщины и девочки подростка. Расчитана под любой стиль и образ как на вечернюю прогулку так и на повседневный раут на работу и магазин.',
      descript4 =
          'Маленькая сумка через плечо станет идеальным дополнением базового женского гардероба, изготовлена из искусственной кожи премиум - качества, оснащена высококачественной, надежной и легкой фурнитурой. Это эксклюзивная модель нашего собственного российского производства - безупречная ручная работа с идеально ровным швами. Экокожа очень приятная, мягкая на ощупь, не выгорает на солнце, устойчива к царапинам. Модель представлена в розовом цвете и еще в большом количестве цветов, полностью соответствует фотографиям.',
      descript5 =
          'Функциональная, но не большая, красивая и при этом практичная - о такой сумке мечтает каждая. Материал сумки- приятная на ощупь и износостойкая искусственная кожа или замша, качественная фурнитура выполнена в серебристом цвете, она мягкая и легкая, но при этом хорошо держит форму. Если вы ищете незаменимый предмет в базовый гардероб на любой сезон, это самый правильный выбор, она подходит для повседневной носки, на учебу и в офис, на свадьбу и свидание. Отличным решением для отпуска и путешествий станет летняя кросс боди среднего размера. Её можно носить через плечо, в руке, на локте.',
      descript6 =
          'Стильная, вместительная и элегантная сумка через плечо коричневого цвета от бренда NY BIN - это идеальный аксессуар для женщин любого возраста. Она подойдет под любой стиль и станет незаменимым дополнением к вашей одежде. Изделие из экокожи премиум - качества обладает небольшим размером и оснащено наружным открытым карманом, длинным съемным текстильным ремнем с прикольным декоративным рисунком.',
      descript7 =
          'Элегантная и стильная женская сумка кросс-боди через плечо в стиле Сэтчел (satchel bag) квадратной формы. Отличительные особенности: жесткий каркас и мягкая премиум экокожа, плоское дно, большое количество внешних и внутренних карманов, перекидной клапан, маленькая удобная ручка, что позволит использовать как мессенджер, а также два отстегивающихся регулируемых плечевых ремня (эргономичный спортивный широкий ремешок и классический из экокожи). Благодаря короткой ручке, ее также можно носить и в руке.',
      descript8 =
          'Трендовая сумка тоут -Christian Dior - это эталон стиля и качества. Женский шоппер из натуральной холщовой ткани – вместительная, практичная и универсальная классика с лаконичным дизайном и массой вариантов расцветки. Две ручки с плоским верхом, спереди принт с логотипом, сзади нашивка с логотипом, застежка на молнии сверху, основное отделение и внутренние накладные карманы, регулируемый съемный плечевой ремень. Практично, стильно и минималистично. Сумочка важная составляющая базового гардероба для аксессуаров, косметики, телефона, документов А4, ноутбука.';
}

sealed class HeadLine {
  static const headline1 = 'Женщинам',
      headline2 = 'Женская сумочка',
      headline3 = 'Цена\n',
      headline4 = 'Цвет',
      headline5 = 'Размер\n',
      headline6 = 'В корзину';
}

sealed class TabNames {
  static const tab1 = 'Сумочки', tab2 = 'Обувь', tab3 = 'Платья', tab4 = 'Юбки';
}
